wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rtc.c
/*!
    \file    gd32f50x_rtc.c
    \brief   RTC driver

    \version 2025-11-10, V1.0.1, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f50x_rtc.h"

/* RTC register bit mask */
#define RTC_STATC_MASK            ((uint32_t)0x0000000FU)               /*!< RTC status clear mask */

/* RTC register bit offset */
#define CNTH_OFFSET               ((uint32_t)0x00000010U)               /*!< bit offset of RTC_CNTH */
#define PSCH_OFFSET               ((uint32_t)0x00000010U)               /*!< bit offset of RTC_PSCH */
#define ALRMH_OFFSET              ((uint32_t)0x00000010U)               /*!< bit offset of RTC_ALRMH */
#define DIVH_OFFSET               ((uint32_t)0x00000010U)               /*!< bit offset of RTC_DIVH */

/*!
    \brief      enter RTC configuration mode (API_ID: 0x0001U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rtc_configuration_mode_enter(void)
{
    RTC_CTL |= RTC_CTL_CMF;
}

/*!
    \brief      exit RTC configuration mode(API_ID: 0x0002U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rtc_configuration_mode_exit(void)
{
    RTC_CTL &= ~RTC_CTL_CMF;
}

/*!
    \brief      wait RTC last write operation finished flag set (API_ID: 0x0003U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
ErrStatus rtc_lwoff_wait(void)
{
    ErrStatus status = ERROR;
    uint32_t timeout = RTC_TIMEOUT;
    
    /* loop until LWOFF flag is set */
    while ((RESET == (RTC_CTL & RTC_CTL_LWOFF)) && (0U != timeout)){
        timeout--;
    }
    
    /* check state */
    if(RESET == (RTC_CTL & RTC_CTL_LWOFF)) {
        status = ERROR;
    } else {
        status = SUCCESS;
    }

    return status;
}

/*!
    \brief      wait RTC registers synchronized flag set (API_ID: 0x0004U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
ErrStatus rtc_register_sync_wait(void)
{
    ErrStatus status = ERROR;
    uint32_t timeout = RTC_TIMEOUT;

    /* clear RSYNF flag */
    RTC_CTL &= ~RTC_CTL_RSYNF;
    
    /* loop until RSYNF flag is set */
    while ((RESET == (RTC_CTL & RTC_CTL_RSYNF)) && (0U != timeout)){
        timeout--;
    }

    /* check state */
    if(RESET == (RTC_CTL & RTC_CTL_RSYNF)) {
        status = ERROR;
    } else {
        status = SUCCESS;
    }

    return status;
}

/*!
    \brief      get RTC counter value (API_ID: 0x0005U)
    \param[in]  none
    \param[out] none
    \retval     RTC counter value
*/
uint32_t rtc_counter_get(void)
{
    uint32_t temp = 0x0U, high_old, high_new;

    high_old = RTC_CNTH;
    temp = RTC_CNTL;
    high_new = RTC_CNTH;

    if(high_old != high_new){
        temp = (high_new << CNTH_OFFSET) | RTC_CNTL;
    }else{
        temp |= (high_new << CNTH_OFFSET);
    }

    return temp;
}

/*!
    \brief      set RTC counter value (API_ID: 0x0006U)
    \param[in]  cnt: RTC counter value
    \param[out] none
    \retval     none
*/
void rtc_counter_set(uint32_t cnt)
{
    rtc_configuration_mode_enter();
    /* set the RTC counter high bits */
    RTC_CNTH = cnt >> CNTH_OFFSET;
    /* set the RTC counter low bits */
    RTC_CNTL = (cnt & RTC_LOW_VALUE);
    rtc_configuration_mode_exit();
}

/*!
    \brief      set RTC prescaler value (API_ID: 0x0007U)
    \param[in]  psc: RTC prescaler value
    \param[out] none
    \retval     none
*/
void rtc_prescaler_set(uint32_t psc)
{
    rtc_configuration_mode_enter();
    /* set the RTC prescaler high bits */
    RTC_PSCH = (psc & RTC_HIGH_VALUE) >> PSCH_OFFSET;
    /* set the RTC prescaler low bits */
    RTC_PSCL = (psc & RTC_LOW_VALUE);
    rtc_configuration_mode_exit();
}

/*!
    \brief      set RTC alarm value (API_ID: 0x0008U)
    \param[in]  alarm: RTC alarm value
    \param[out] none
    \retval     none
*/
void rtc_alarm_config(uint32_t alarm)
{
    rtc_configuration_mode_enter();
    /* set the alarm high bits */
    RTC_ALRMH = alarm >> ALRMH_OFFSET;
    /* set the alarm low bits */
    RTC_ALRML = (alarm & RTC_LOW_VALUE);
    rtc_configuration_mode_exit();
}

/*!
    \brief      get RTC divider value (API_ID: 0x0009U)
    \param[in]  none
    \param[out] none
    \retval     RTC divider value
*/
uint32_t rtc_divider_get(void)
{
    uint32_t temp = 0x00U;
    temp = (RTC_DIVH & RTC_DIVH_DIV) << DIVH_OFFSET;
    temp |= RTC_DIVL;
    return temp;
}

/*!
    \brief      enable RTC interrupt (API_ID: 0x0001U) (API_ID: 0x000AU)
    \param[in]  interrupt: specify which interrupt to enbale
          \arg    RTC_INT_SECOND: second interrupt
          \arg    RTC_INT_ALARM: alarm interrupt
          \arg    RTC_INT_OVERFLOW: overflow interrupt
    \param[out] none
    \retval     none
*/
void rtc_interrupt_enable(uint32_t interrupt)
{
    RTC_INTEN |= (interrupt & (RTC_INTEN_SCIE | RTC_INTEN_ALRMIE | RTC_INTEN_OVIE));
}

/*!
    \brief      disable RTC interrupt (API_ID: 0x000BU)
    \param[in]  interrupt: specify which interrupt to disbale
          \arg    RTC_INT_SECOND: second interrupt
          \arg    RTC_INT_ALARM: alarm interrupt
          \arg    RTC_INT_OVERFLOW: overflow interrupt
    \param[out] none
    \retval     none
*/
void rtc_interrupt_disable(uint32_t interrupt)
{
    RTC_INTEN &= ~(interrupt & (RTC_INTEN_SCIE | RTC_INTEN_ALRMIE | RTC_INTEN_OVIE));
}

/*!
    \brief      get RTC flag status (API_ID: 0x000CU)
    \param[in]  flag: specify which flag status to get
          \arg    RTC_FLAG_SECOND: second interrupt flag
          \arg    RTC_FLAG_ALARM: alarm interrupt flag
          \arg    RTC_FLAG_OVERFLOW: overflow interrupt flag
          \arg    RTC_FLAG_RSYN: registers synchronized flag
          \arg    RTC_FLAG_LWOF: last write operation finished flag
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus rtc_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;
    if(RESET != (RTC_CTL & flag)){
        status = SET;
    }else{
        status = RESET;
    }
    
    return status;
}

/*!
    \brief      clear RTC flag status (API_ID: 0x000DU)
    \param[in]  flag: specify which flag status to clear
          \arg    RTC_FLAG_SECOND: second interrupt flag
          \arg    RTC_FLAG_ALARM: alarm interrupt flag
          \arg    RTC_FLAG_OVERFLOW: overflow interrupt flag
          \arg    RTC_FLAG_RSYN: registers synchronized flag
    \param[out] none
    \retval     none
*/
void rtc_flag_clear(uint32_t flag)
{
    /* clear RTC flag */
    RTC_CTL &= ~(flag & RTC_STATC_MASK);
}
